// Задача 40: Напишите программу, которая принимает на вход три числа и проверяет,
// может ли существовать треугольник с сторонами такой длины.
// Теорема о неравенстве треугольника:
// каждая сторона треугольника меньше суммы двух других сторон.

Console.Write("Введите первое число");
int varA = int.Parse(Console.ReadLine() ?? "");

Console.Write("Введите второе число");
int varB = int.Parse(Console.ReadLine() ?? "");

Console.Write("Введите третье число");
int varC = int.Parse(Console.ReadLine() ?? "");

